const convertSpecialChars = (str) => {
  const from = [
    '㈱', '㈲', '㈹',
    '①', '②', '③', '④', '⑤', '⑥', '⑦', '⑧', '⑨', '⑩', '⑪', '⑫', '⑬', '⑭', '⑮', '⑯', '⑰', '⑱', '⑲', '⑳',
    '㉑', '㉒', '㉓', '㉔', '㉕', '㉖', '㉗', '㉘', '㉙', '㉚', '㉛', '㉜', '㉝', '㉞', '㉟', '㊱', '㊲', '㊳', '㊴', '㊵',
    '㊶', '㊷', '㊸', '㊹', '㊺', '㊻', '㊼', '㊽', '㊾', '㊿',
    'Ⅰ', 'Ⅱ', 'Ⅲ', 'Ⅳ', 'Ⅴ', 'Ⅵ', 'Ⅶ', 'Ⅷ', 'Ⅸ', 'Ⅹ',
    '㍉', '㌔', '㌢', '㍍', '㌘', '㌧', '㌃', '㌶', '㍑', '㍗', '㌍', '㌦', '㌣', '㌫', '㍊', '㌻',
    '㎜', '㎝', '㎞', '㎎', '㎏', '㏄', '㎡',
    '㍾', '㍽', '㍼', '㍻',
    '〝', '〟', '№', '㏍', '℡', '㊤', '㊥', '㊦', '㊧', '㊨'
  ]
  const to = [
    '株式会社', '有限会社', '代表',
    '１', '２', '３', '４', '５', '６', '７', '８', '９', '１０', '１１', '１２', '１３', '１４', '１５', '１６', '１７', '１８', '１９', '２０',
    '２１', '２２', '２３', '２４', '２５', '２６', '２７', '２８', '２９', '３０', '３１', '３２', '３３', '３４', '３５', '３６', '３７', '３８', '３９', '４０',
    '４１', '４２', '４３', '４４', '４５', '４６', '４７', '４８', '４９', '５０',
    'I', 'II', 'III', 'IV', 'V', 'VI', 'VII', 'VIII', 'IX', 'X',
    'ミリ', 'キロ', 'センチ', 'メートル', 'グラム', 'トン', 'アール', 'ヘクタール', 'リットル', 'ワット', 'カロリー', 'ドル', 'セント', 'パーセント', 'ミリバール', 'ページ',
    'mm', 'cm', 'km', 'mg', 'kg', 'cc', '平方メートル',
    '明治', '大正', '昭和', '平成',
    '「', '」', 'No.', 'K.K.', 'TEL', '(上)', '(中)', '(下)', '(左)', '(右)'
  ]
  for (var i = 0; i <= from.length; i++) {
    str = str.replace(from[i], to[i]);
  }
  return str
}

const validateSpecialChars = (str) => {
  const pattern = /(∮|∟|⊿|纊|褜|鍈|銈|蓜|俉|炻|昱|棈|鋹|曻|彅|丨|仡|仼|伀|伃|伹)/
  console.log(pattern.test(str))
  if (pattern.test(str)) {
    throw new Error(`${fieldName}が${size}バイトを超えたデータは登録できません。`)
  }
  return true
}


module.exports = {
  convertSpecialChars,
  validateSpecialChars,
}
